The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public ICollection<ElementId> GetConstructionTypeIds()
  Visual Basic
Public Function GetConstructionTypeIds As ICollection(Of ElementId)
  Visual C++
public:
ICollection<ElementId^>^ GetConstructionTypeIds()
 See Also
  ConceptualSurfaceType Class
  Autodesk.Revit.DB.Analysis Namespace